BlissRoms-x86/kernel_common/drivers/staging/rtl8723bu/hal/hal_com.c
static const char * const _wl_func_str[] = {
	/* BIT0 */"P2P",
	/* BIT1 */"MIRACAST",
	/* BIT2 */"TDLS",
	/* BIT3 */"FTM",
};

void dump_hal_spec(void *sel, _adapter *adapter)
{
	struct hal_spec_t *hal_spec = GET_HAL_SPEC(adapter);
	int i;

	DBG_871X_SEL_NL(sel, "macid_num:%u\n", hal_spec->macid_num);
	DBG_871X_SEL_NL(sel, "sec_cap:0x%02x\n", hal_spec->sec_cap);
	DBG_871X_SEL_NL(sel, "sec_cam_ent_num:%u\n", hal_spec->sec_cam_ent_num);
	DBG_871X_SEL_NL(sel, "nss_num:%u\n", hal_spec->nss_num);

	DBG_871X_SEL_NL(sel, "band_cap:");
	for (i = 0; i < BAND_CAP_BIT_NUM; i++) {
		if (((hal_spec->band_cap) >> i) & BIT0 && _band_cap_str[i])
			DBG_871X_SEL(sel, "%s ", _band_cap_str[i]);
	}
	DBG_871X_SEL(sel, "\n");

	DBG_871X_SEL_NL(sel, "bw_cap:");
	for (i = 0; i < BW_CAP_BIT_NUM; i++) {
		if (((hal_spec->bw_cap) >> i) & BIT0 && _bw_cap_str[i])
			DBG_871X_SEL(sel, "%s ", _bw_cap_str[i]);
	}
	DBG_871X_SEL(sel, "\n");

	DBG_871X_SEL_NL(sel, "proto_cap:");
	for (i = 0; i < PROTO_CAP_BIT_NUM; i++) {
		if (((hal_spec->proto_cap) >> i) & BIT0 && _proto_cap_str[i])
			DBG_871X_SEL(sel, "%s ", _proto_cap_str[i]);
	}
	DBG_871X_SEL(sel, "\n");

	DBG_871X_SEL_NL(sel, "wl_func:");
	for (i = 0; i < WL_FUNC_BIT_NUM; i++) {
		if (((hal_spec->wl_func) >> i) & BIT0 && _wl_func_str[i])
			DBG_871X_SEL(sel, "%s ", _wl_func_str[i]);
	}
	DBG_871X_SEL(sel, "\n");
}

inline bool hal_chk_band_cap(_adapter *adapter, u8 cap)
{
	return (GET_HAL_SPEC(adapter)->band_cap & cap);
}

inline bool hal_chk_bw_cap(_adapter *adapter, u8 cap)
{
	return (GET_HAL_SPEC(adapter)->bw_cap & cap);
}

inline bool hal_chk_proto_cap(_adapter *adapter, u8 cap)
{
	return (GET_HAL_SPEC(adapter)->proto_cap & cap);
}

inline bool hal_chk_wl_func(_adapter *adapter, u8 func)
{
	return (GET_HAL_SPEC(adapter)->wl_func & func);
}

inline bool hal_is_band_support(_adapter *adapter, u8 band)
{
	return (GET_HAL_SPEC(adapter)->band_cap & band_to_band_cap(band));
}

inline bool hal_is_bw_support(_adapter *adapter, u8 bw)
{
	return (GET_HAL_SPEC(adapter)->bw_cap & ch_width_to_bw_cap(bw));
}

inline bool hal_is_wireless_mode_support(_adapter *adapter, u8 mode)
{
	u8 proto_cap = GET_HAL_SPEC(adapter)->proto_cap;

	if (mode == WIRELESS_11B)
		if ((proto_cap & PROTO_CAP_11B) && hal_chk_band_cap(adapter, BAND_CAP_2G))
			return 1;

	if (mode == WIRELESS_11G)
		if ((proto_cap & PROTO_CAP_11G) && hal_chk_band_cap(adapter, BAND_CAP_2G))
			return 1;

	if (mode == WIRELESS_11A)
		if ((proto_cap & PROTO_CAP_11G) && hal_chk_band_cap(adapter, BAND_CAP_5G))
			return 1;

	if (mode == WIRELESS_11_24N)
		if ((proto_cap & PROTO_CAP_11N) && hal_chk_band_cap(adapter, BAND_CAP_2G))
			return 1;

	if (mode == WIRELESS_11_5N)
		if ((proto_cap & PROTO_CAP_11N) && hal_chk_band_cap(adapter, BAND_CAP_5G))
			return 1;

	if (mode == WIRELESS_11AC)
		if ((proto_cap & PROTO_CAP_11AC) && hal_chk_band_cap(adapter, BAND_CAP_5G))
			return 1;

	return 0;
}

/*
* hal_largest_bw - starting from in_bw, get largest bw supported by HAL
* @adapter:
* @in_bw: starting bw, value of CHANNEL_WIDTH
*
* Returns: value of CHANNEL_WIDTH
*/
u8 hal_largest_bw(_adapter *adapter, u8 in_bw)
{
	for (; in_bw > CHANNEL_WIDTH_20; in_bw--) {
		if (hal_is_bw_support(adapter, in_bw))
			break;
	}

	if (!hal_is_bw_support(adapter, in_bw))
		rtw_warn_on(1);

	return in_bw;
}

